# Выведите статистику частности букв в кортеже.
long_word = ( 'т', 'т', 'а', 'и', 'и', 'а', 'и','и', 'и',
              'т', 'т', 'а', 'и', 'и','и', 'и', 'и', 'т', 'и',)
print(long_word)
print("Количество буквы 'т':  ", long_word.count('т'))
print("Количество буквы 'а':  ", long_word.count('а'))
print("Количество буквы 'и':  ", long_word.count('и'))